Padrelab/ESP32-SD-Wifi-Wav-Player/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_LOG_DYNAMIC_LEVEL_CONTROL=y
CONFIG_LOG_TAG_LEVEL_IMPL_LINKED_LIST=y
# CONFIG_ESPTOOLPY_FLASH_MODE_AUTO_DETECT is not set
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESP_SLEEP_PSRAM_LEAKAGE_WORKAROUND=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_40M=y
CONFIG_SPIRAM_BOOT_HW_INIT=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_PLAYER_READ_BUFFER_SIZE=6144
CONFIG_PLAYER_TASK_PRIORITY=10
CONFIG_SD_SPI_PIN_MOSI=11
CONFIG_SD_SPI_PIN_MISO=13
CONFIG_SD_SPI_PIN_SCLK=12
CONFIG_SD_SPI_PIN_CS=10
CONFIG_SD_SPI_FREQUENCY_KHZ=16000
CONFIG_I2S_DOUT_PIN=4
CONFIG_I2S_BCLK_PIN=5
CONFIG_I2S_WS_PIN=6
CONFIG_I2S_MCLK_PIN=-1
